# Tips and Trick Python Pandas 18

# Membentuk Dummy Data Frame

# Import Module

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

# 3 Cara Buat Data Frame

1. Struktur Data `Dictionary`

In [3]:
pd.DataFrame({'col1':[1, 2, 3, 4],
             'col2':[5, 6, 7, 8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

2. `Numpy Array`

In [4]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1, 20, size=(n_rows, n_cols))

arr

array([[ 9,  9, 16],
       [ 7, 10,  2],
       [12, 10,  1],
       [19, 12, 19],
       [12, 16,  4]])

In [5]:
pd.DataFrame(arr, columns=tuple('ABC'))

    A   B   C
0   9   9  16
1   7  10   2
2  12  10   1
3  19  12  19
4  12  16   4

# Membentuk Data Frame dengan memanfaatkan `pandas.util.testing`

1. Data Frame

In [6]:
pd.util.testing.makeDataFrame().head()

C:\Users\ronal\anaconda3\lib\site-packages\pandas\util\__init__.py:8: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                   A         B         C         D
Rqj7TM6dqd -1.164662 -0.369603  0.671890 -1.752743
89AEb3CooJ -0.842375  0.240596  0.637464 -0.928127
Z0qe2frs1u -0.111546  0.888410  0.301162  1.374522
cBeeq3clvb  2.178052  0.320682  1.830880  0.178606
tNc9gUe20m  0.055901  1.691400 -0.316217 -0.631692

2. Tipe Data Campur

In [11]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

3. Data Deret Waktu

In [8]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03 -1.590220 -1.664319 -0.068502 -0.423522
2000-01-04 -2.103839  0.484063 -1.685758  0.619783
2000-01-05  0.959964 -0.535674 -0.415141  0.132268
2000-01-06  0.128701 -0.858555  1.275873  1.050357
2000-01-07  0.811198 -0.339874 -1.116918  1.038765

4. Data Frame dengan beberapa Missing Value secara acak

In [12]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
Du9CEZ54f6  0.867167 -0.092378 -1.269405 -0.844118
N9B7Vy0EvQ  0.108767 -0.144670 -0.080937 -0.608616
CMsvm3sgnM  1.302765 -0.438035       NaN -1.639386
YlfJNy19Lq  0.063514       NaN       NaN  1.761429
49meJYw7FR -1.516101  0.442323 -0.274754  0.073039